Revit 2026 API

# DimensionSegmentOrigin Property

---

The segment origin.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Origin { get; }
```
```vb
Public ReadOnly Property Origin As XYZ
	Get
```
```cpp
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```
```fsharp
member Origin : XYZ with get
```

#### Property Value

XYZ

The origin will be the midpoint of the line that makes up the segment.

#### Reference

DimensionSegment Class

Autodesk.Revit.DB Namespace